# 创建一个集合
s1 = set()  # ---空集合
# 集合
s2 = {1, 3, 4, 5, 6, 6, 7, 8, 9, 0, 8, 6, 2, "字符串", (1, 2, 4)}
print(s2)
# 追加-1
s1.add(100)
print(s1)
# 追加--update(), 追加的数据是序列 只能追加不可变数据
s1.update([10, 20],(1,23,4),"2","dddd")
s2.update((1, 3, 45, 66, 100, 'ssss', (1, 2, 3, 4), ' '))  # 集合有去重功能,同样的数据不能加进去
print(s1)
print(s2)
# remove()，删除集合中的指定数据，如果数据不不存在则报错
s1.remove(100)
print(s1)
# discard()，删除集合中的指定数据，如果数据不不存在也不不会报错
s2.discard("字符串1")
print(s2)
# pop()，随机删除集合中的某个数据，并返回这个数据(删除的数据)-不支持指定下标删除
print(s1.pop)

# 查找
# in:判断数据在集合序列
print(" " in s2)
# not in:判断数据不不在集合序列
print(10 not in s2)
